import pandas as pd
#создаём адресную книгу
book = pd.DataFrame({
    "ФИО": ["Иванов Иван Иванович", "Петрова Анна Сергеевна", "Сидоров Пётр Николаевич", "Козлова Мария Андреевна"],
    "Адрес": ["г. Минск, ул. Ленина, д. 10", "г. Гомель, ул. Советская, д. 25", "г. Витебск, ул. Мира, д. 7", "г. Гродно, ул. Победы, д. 3"],
    "Телефон": ["+375291234567", "+375292345678", "+375293456789", "+375294567890"],
    "Дата рождения": ["01.01.1990", "15.05.1985", "23.11.1978", "07.03.1995"]
})
print("Aдресная книга: ",book)#выводим исходную матрицу 
question =str(input("Что вы хотите сделать с адресной книгой?"))#дам пользователю выюор действия
if question =="Добавить":#если пользователь хочет добавить , записываем алгоритм действий
    fio = input("введите ФИо: ") #вводиим новые данные
    adres =input("Введите адрес: ")
    telefon = input("Введите телефон:")
    data= input("Введите дату рождения: ")
    book.loc[len(book)] = [fio,adres,telefon,data] #добавляем новую строку в конец таблицы
    print("запись добавлена: " ,book) #выводим получившуюся матрицу

elif question == "Удалить":#если пользователь хочет удалить , записываем алгоритм действий
    nomer = int(input("Введите номер записи для удаления:"))#ввод номера строки ,который хотим удалить
    book =book.drop(index= nomer)#удаляем нужную нам строку с нужным нам введенным индексом nomer
    book = book.reset_index(drop= True) #перезаписываем индексы таблицы
    print("Запись удалена: ",book)#выводим получившуюся матрицу

elif question == "Изменить":
    nomer =int(input("введите номер записи для изменения: "))#ввод номера строки ,который хотим изменить
    pole = input("Введите название поля (ФИО,Адрес,Телефон,Дата рождения): ")#ищем указание ,КОторое хотим искать
    znachenie = input("введите новое значение: ")#ввод новых значений
    book.loc[nomer,pole] = znachenie#изменение значения конкретной ячейки в таблице
    print("запись изменена:",book)#выводим получившуюся матрицу
else:
    print("Вы ввели отсутствующие действие") # при ошибки пользователя