import numpy as np
N =int(input("Введите строк N:")) #вводим количество строк
M = int(input("Введите столбцов M:"))#вводим количество столбцов

matrix = np.random.randint(-10, 10,size=(N,M))# заполняем матрицу рандомными значениями от -10 до 10
print("Матрица:",matrix)# выводим получившуюся матрицы

matrixTranspon= np.transpose(matrix)#транспонируем матрицу
print("Транспонированная:",matrixTranspon )#выводим транспонированную матрицу 

if N == M:# можем искать определитель только ,когда матрица квадратная , а значит количество строк равно количеству столбцов
    opr1 = np.linalg.det(matrix)#находим определитель исходной матрицы
    opr2 = np.linalg.det(matrixTranspon)#находим определитель транспонированной матрицы
    print("Первый определитель:",opr1)#выводим определитель исходной матрицы
    print("Второй определитель :", opr2)#выводим определитель транспонированной матрицы
    if opr1 == opr2: #сравниваем определители
        print("Опрееделители равны")
    else:
        print("Опрееделители не равны")
else:#случай , если матрица не квадратаня
    print("матрица не квадратная,определителя нет")